modules/testsuite/native-tests/src/test/resources/benchmark/jmeter/rpclit/req2.xml

<env:Envelope xmlns:env='http://schemas.xmlsoap.org/soap/envelope/'>
    <env:Header/>
    <env:Body>
        <ns1:echoArrayOfSimpleUserType xmlns:ns1='http://org.jboss.ws/benchmark'>
            <arrayOfSimpleUserType_1 xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'>
                <value>
                    <f>1.0</f>
                    <i>1</i>
                    <s>test</s>
                </value>
            </arrayOfSimpleUserType_1>
        </ns1:echoArrayOfSimpleUserType>
    </env:Body>
</env:Envelope>